doom.d/config.org
#+TITLE: Emacs Config

* General Settings
** General
#+begin_src emacs-lisp
;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-
;;; Code:
;;
;; Basic configs
;;

(setq user-full-name "Koichi Yoshigoe"
      user-mail-address "koichi.yoshigoe@gmail.com")

;; doom basics
(setq doom-font (font-spec :family "Hack Nerd Font" :size 18)
      doom-variable-pitch-font (font-spec :family "Hack Nerd Font Mono" :size 18)
      doom-serif-font (font-spec :family "UbuntuMono Nerd Font" :weight 'Regular)
      doom-unicode-font (font-spec :family "Hack Nerd Font Mono" :size 18)
      doom-big-font (font-spec :family "Hack Nerd Font Mono" :size 24)
      doom-theme 'doom-dark+
      +doom-dashboard-name "emacs")
(doom-themes-org-config)

(set-frame-parameter (selected-frame) 'alpha '(93 . 75))

(setq-default delete-by-moving-to-trash t)

;; lsp-mode tuning
(setq gc-cons-threshold 100000000
      read-process-output-max (* 2048 2048))

(setq delete-auto-save-files t
      display-line-numbers-type nil
      inhibit-startup-message t
      mouse-wheel-follow-mouse t
      show-paren-mode 1
      line-number-mode t
      column-number-mode t

      menu-bar-mode nil
      scroll-bar-mode nil
      tool-bar-mode nil
      visible-bell nil

      undo-limit 8000000
      ;; desktop file
      ;; (desktop-save-mode 1)
      ;; (setq desktop-save t)
      ;; (setq desktop-restore-eager 10)
      ;; (setq desktop-path '("~/.emacs.d/desktop/"))
      auto-save-default t
      global-auto-revert-mode 1

      c-auto-newline t
      tab-width 2
      indent-tabs-mode nil

      ;; disable auto line-breaking
      auto-fill-mode -1

      backup-directory-alist
      `((".*" . ,temporary-file-directory))
      auto-save-file-name-transforms
      `((".*" ,temporary-file-directory t)))

(display-time-mode 1)
(setq display-time-24hr-format t
      display-time-format "%H:%M")

(global-subword-mode 1)

(setq org-directory "~/GatsbyDrive/org/")

(defalias 'yes-or-no-p 'y-or-n-p)
(setq-default indent-tabs-mode nil)
;; (defvaralias 'c-basic-offsett 'tab-width)
;; (defvaralias 'cperl-indent-level 'tab-width)

(prefer-coding-system       'utf-8)
(set-default-coding-systems 'utf-8)
(set-terminal-coding-system 'utf-8)
(set-keyboard-coding-system 'utf-8)
(setq default-buffer-file-coding-system 'utf-8)
;; (put 'upcase-region 'disabled nil)
;; (add-to-list 'global-mode-string '(" %i"))

(set-language-environment "Japanese")
#+end_src

*** Mouse
#+begin_src emacs-lisp :tangle no
;; (xterm-mouse-mode t)
;; (global-set-key   [mouse-4] '(lambda () (interactive) (scroll-down 1)))
;; (global-set-key   [mouse-5] '(lambda () (interactive) (scroll-up   1)))
#+end_src
*** Battery Display
#+begin_src emacs-lisp
(unless (equal "Battery status not available"
               (battery))
  (display-battery-mode 1))
#+end_src

** COMMENT ivy/counsel/swiper
#+begin_src emacs-lisp
(after! ivy
  (setq ivy-use-virtual-buffers t
        ivy-re-builders-alist
        '((t . ivy--regex-ignore-order))
        ivy-truncate-lines nil
        ivy-display-style 'fancy
        ivy-initial-inputs-alist nil
        ivy-height 22
        ivy-wrap t
        enable-recursive-minibuffers t)
  ;; (when (setq enable-recursive-minibuffers t)
  ;; (minibuffer-depth-indcate-mode 1))
  (setq ivy-initial-inputs-alist
        '((counsel-minor . "")
          (counsel-package . "")
          (counsel-org-capture . "")
          (counsel-M-x . "")
          (counsel-describe-function . "")
          (counsel-describe-variable . "")))
  (setq ivy-read-action-function #'ivy-hydra-read-action)
  (setq ivy-re-builders-alist
        '((t . ivy--regex-plus)))
  (defadvice! prompt-for-buffer (&rest _)
    :after '(evil-window-split evil-window-vsplit)
    (+ivy/switch-buffer))

  (setq +ivy-buffer-preview t
        +ivy-project-search-engines '(rg))
  (ivy-add-actions
   'counsel-M-x
   `(("h" +ivy/helpful-function "Helpful")))
  (ivy-mode 1)
  (ivy-rich-mode 1))

(after! counsel
  (counsel-mode 1))
;; (setq counsel-find-file-ignore-regexp (regexp-opt '("./" "../"))))
;; :bind
;; ("M-y" . 'counsel-yank-pop)
;; ("M-s" . 'counsel-ibuffer))
#+end_src
** projectile
#+begin_src emacs-lisp
(use-package! projectile
  :config
  (projectile-mode +1)
  (projectile-load-known-projects))
#+end_src
** hl-todo
Highlite TODO strings
#+begin_src emacs-lisp
(use-package! hl-todo
  :hook (prog-mode . hl-todo-mode)
  :config
  (setq hl-todo-highlight-punctuation ":")
  (global-hl-todo-mode 1))
#+end_src
** yasnippet
#+begin_src emacs-lisp :tangle no
(after! yasnippet
  (yas-global-mode))
#+end_src
** Tramp
#+begin_src emacs-lisp
(use-package! counsel-tramp
  :commands (counsel-tramp))
(setq tramp-auto-save-directory "~/tmp/tramp/")
(setq tramp-chunksize 2000)
#+end_src
** Company
#+begin_src emacs-lisp
(after! company
  ;; :bind
  ;; (:map company-active-map
  ;;  (("C-j" . company-select-next)
  ;;   ("C-n" . company-select-next)
  ;;   ("C-k" . company-select-previous)
  ;;   ("C-p" . company-select-previous)
  ;;   ("C-d" . company-show-doc-buffer)
  ;;   ("M-n" . nil)
  ;;   ("M-p" . nil)
  ;;   ("C-n" . company-select-next)
  ;;   ("C-p" . company-select-previous)
  ;;   ("C-h" . nil)
  ;;   ("C-s" . company-filter-candidates)
  ;;   ("C-i" . company-complete-selection)
  ;;   ("<tab>" . company-complete-common-or-cycle)
  ;;   ("M-d" . company-show-doc-buffer))
  ;;  :map company-search-map
  ;;  (("C-n" . company-select-next)
  ;;   ("C-p" . company-select-previous)))
  :config
  (setq company-quickhelp-mode +1
        company-idle-delay 0.2
        company-transformers '(company-sort-by-backend-importance)
        company-minimum-prefix-length 3
        company-selection-wrap-around t
        completion-ignore-case t))

;;(add-to-list 'company-backends '(company-capf company-files company-yasnippet)))
#+end_src

** Selectrum
#+begin_src emacs-lisp
(use-package! selectrum
  :config
  (selectrum-mode +1))
#+end_src
** Which-Key
#+begin_src emacs-lisp
(use-package! which-key
  :config
  (setq which-key-idle-secondary-delay 0.05
        which-key-idle-delay 0.6)
  (which-key-mode))
#+end_src
** visual-fill(disabled)
#+begin_src emacs-lisp :tangle no
(use-package! visual-fill-column
  :config
  (setq visual-fill-column-width 120
        visual-fill-column-center-text t))
#+end_src
** OS
*** macOS
#+begin_src emacs-lisp
(when (equal system-type 'darwin)
  ;; (setq mac-option-modifier 'super)
  ;; (setq mac-command-modifier 'meta)
  (setq ns-auto-hide-menu-bar nil)
  (setq ns-use-proxy-icon nil)
  (setq initial-frame-alist
        (append
         '((ns-transparent-titlebar . nil)
           (ns-appearance . dark)
           (vertical-scroll-bars . nil)
           (internal-border-width . 0)))))
#+end_src

* Org-mode
