doom.d/config.el
;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-
;;; Code:
;;
;; Basic configs
;;

(setq user-full-name "Koichi Yoshigoe"
      user-mail-address "koichi.yoshigoe@gmail.com")

;; doom basics
(setq doom-font (font-spec :family "Hack Nerd Font" :size 18)
      doom-variable-pitch-font (font-spec :family "Hack Nerd Font Mono" :size 18)
      doom-serif-font (font-spec :family "UbuntuMono Nerd Font" :weight 'Regular)
      doom-unicode-font (font-spec :family "Hack Nerd Font Mono" :size 18)
      doom-big-font (font-spec :family "Hack Nerd Font Mono" :size 24)
      doom-theme 'doom-dark+
      +doom-dashboard-name "emacs")
(doom-themes-org-config)

(set-frame-parameter (selected-frame) 'alpha '(93 . 75))

(setq-default delete-by-moving-to-trash t)

;; lsp-mode tuning
(setq gc-cons-threshold 100000000
      read-process-output-max (* 2048 2048))

(setq delete-auto-save-files t
      display-line-numbers-type nil
      inhibit-startup-message t
      mouse-wheel-follow-mouse t
      show-paren-mode 1
      line-number-mode t
      column-number-mode t

      menu-bar-mode nil
      scroll-bar-mode nil
      tool-bar-mode nil
      visible-bell nil

      undo-limit 8000000
      ;; desktop file
      ;; (desktop-save-mode 1)
      ;; (setq desktop-save t)
      ;; (setq desktop-restore-eager 10)
      ;; (setq desktop-path '("~/.emacs.d/desktop/"))
      auto-save-default t
      global-auto-revert-mode 1

      c-auto-newline t
      tab-width 2
      indent-tabs-mode nil

      ;; disable auto line-breaking
      auto-fill-mode -1

      backup-directory-alist
      `((".*" . ,temporary-file-directory))
      auto-save-file-name-transforms
      `((".*" ,temporary-file-directory t)))

(display-time-mode 1)
(setq display-time-24hr-format t
      display-time-format "%H:%M")

(global-subword-mode 1)

(setq org-directory "~/GatsbyDrive/org/")

(defalias 'yes-or-no-p 'y-or-n-p)
(setq-default indent-tabs-mode nil)
;; (defvaralias 'c-basic-offsett 'tab-width)
;; (defvaralias 'cperl-indent-level 'tab-width)

(prefer-coding-system       'utf-8)
(set-default-coding-systems 'utf-8)
(set-terminal-coding-system 'utf-8)
(set-keyboard-coding-system 'utf-8)
(setq default-buffer-file-coding-system 'utf-8)
;; (put 'upcase-region 'disabled nil)
;; (add-to-list 'global-mode-string '(" %i"))

(set-language-environment "Japanese")

(unless (equal "Battery status not available"
               (battery))
  (display-battery-mode 1))

(use-package! projectile
  :config
  (projectile-mode +1)
  (projectile-load-known-projects))

(use-package! hl-todo
  :hook (prog-mode . hl-todo-mode)
  :config
  (setq hl-todo-highlight-punctuation ":")
  (global-hl-todo-mode 1))

(use-package! counsel-tramp
  :commands (counsel-tramp))
(setq tramp-auto-save-directory "~/tmp/tramp/")
(setq tramp-chunksize 2000)

(after! company
  ;; :bind
  ;; (:map company-active-map
  ;;  (("C-j" . company-select-next)
  ;;   ("C-n" . company-select-next)
  ;;   ("C-k" . company-select-previous)
  ;;   ("C-p" . company-select-previous)
  ;;   ("C-d" . company-show-doc-buffer)
  ;;   ("M-n" . nil)
  ;;   ("M-p" . nil)
  ;;   ("C-n" . company-select-next)
  ;;   ("C-p" . company-select-previous)
  ;;   ("C-h" . nil)
  ;;   ("C-s" . company-filter-candidates)
  ;;   ("C-i" . company-complete-selection)
  ;;   ("<tab>" . company-complete-common-or-cycle)
  ;;   ("M-d" . company-show-doc-buffer))
  ;;  :map company-search-map
  ;;  (("C-n" . company-select-next)
  ;;   ("C-p" . company-select-previous)))
  :config
  (setq company-quickhelp-mode +1
        company-idle-delay 0.2
        company-transformers '(company-sort-by-backend-importance)
        company-minimum-prefix-length 3
        company-selection-wrap-around t
        completion-ignore-case t))

;;(add-to-list 'company-backends '(company-capf company-files company-yasnippet)))

(use-package! selectrum
  :config
  (selectrum-mode +1))

(use-package! which-key
  :config
  (setq which-key-idle-secondary-delay 0.05
        which-key-idle-delay 0.6)
  (which-key-mode))

(when (equal system-type 'darwin)
  ;; (setq mac-option-modifier 'super)
  ;; (setq mac-command-modifier 'meta)
  (setq ns-auto-hide-menu-bar nil)
  (setq ns-use-proxy-icon nil)
  (setq initial-frame-alist
        (append
         '((ns-transparent-titlebar . nil)
           (ns-appearance . dark)
           (vertical-scroll-bars . nil)
           (internal-border-width . 0)))))
