doom.d/config.org
*** Basics
#+begin_src emacs-lisp
(defun my/org-setup()
  (org-indent-mode)
  (org-bullets-mode)
  (visual-line-mode 1))

(use-package! org
  :mode
  ("\\.org$" . org-mode)
  :bind
  (("C-c l" . org-store-link)
   ("C-c a" . org-agenda))
  :config
  (setq org-ellipsis " ▼ "
        org-default-notes-file (concat org-directory "/note.org")
        org-agenda-files '("~/GatsbyDrive/org/" "~/GatsbyDrive/org/jira/" "~/GatsbyDrive/org/gcal/" )
        org-return-follows-link t
        org-log-done 'time
        org-startup-truncated nil
        org-refile-targets '((org-agenda-files :maxlevel . 2)))
  (setq org-todo-keywords
        ;; Sequence for TASKS
        '((sequence "TODO(t)" "SOMEDAY(s)" "InProgress(i)" "WAITING(w)" "|" "DONE(d)" "CANCELED(c@)")))
  (setq org-capture-templates
        '(("a" "Appointment" entry (file  "~/GatsbyDrive/org/gcal.org" )
           "* %?\n\n%^T\n\n:PROPERTIES:\n\n:END:\n\n")
          ("l" "Link" entry (file+headline "~/GatsbyDrive/org/links.org" "Links")
           "* %? %^L %^g \n%T" :prepend t)
          ("i" "Idea" entry (file+headline "~/GatsbyDrive/org/note.org" "Idea Topics:")
           "* %?\n%T" :prepend t)
          ("t" "To Do Item" entry (file+headline "~/GatsbyDrive/org/note.org" "INBOX")
           "* TODO %?\n%u\n" :prepend t)
          ("n" "Note" entry (file+headline "~/GatsbyDrive/org/note.org" "NOTE SPACE")
           "* %?\n%u\n" :prepend t)
          ("m" "MTG" entry (file+headline "~/GatsbyDrive/org/note.org" "MTG Log")
           "* %?\n%u\n" :prepend t)
          ("j" "Journal" entry (file+datetree "~/GatsbyDrive/org/journal.org")
           "* %?\nEntered on %U\n %i\n %a")))
  (setq org-babel-python-command "python3")
  (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
  (add-to-list 'org-structure-template-alist '("go" . "src go"))
  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
  (add-to-list 'org-structure-template-alist '("py" . "src python"))
  :hook
  (org-agenda-mode-hook . (lambda ()
                            (add-hook 'auto-save-hook 'org-save-all-org-buffers nil t)
                            (auto-save-mode)))
  (org-mode . my/org-setup))

;; company
(after! org
  (set-company-backend! 'org-mode 'company-yasnippet 'company-capf 'company-files 'company-elisp))

;; agenda
(setq org-agenda-custom-commands
      '(("x" "Unscheduled Tasks" tags-todo
         "-SCHEDULED>=\"<today>\"-DEADLINE>=\"<today>\"" nil)
        ("d" "Daily Tasks" agenda ""
         ((org-agenda-span 1)))))
(setq org-agenda-skip-scheduled-if-done t)
#+end_src
*** Org-gcal
#+begin_src emacs-lisp
(after! org
  (use-package! org-tempo)
  (use-package! org-gcal
    :hook
    (org-agenda-mode-hook . (lambda () (org-gcal-sync) ))
    (org-capture-after-finalize-hook . (lambda() (org-gcal-sync)))
    :config
    (setq org-gcal-client-id (getenv "GCAL_CLIENT_ID")
          org-gcal-client-secret (getenv "GCAL_CLIENT_SECRET")
          org-gcal-file-alist '(("gatsby.gatsby.gatsby@gmail.com" . "~/GatsbyDrive/org/gcal/gcal.org")
                                ("yoshigoe@leapmind.io" . "~/GatsbyDrive/org/gcal/gcal-work.org"))
          org-gcal-up-days 7)))
#+end_src
*** org other
org-github-issues
#+begin_src emacs-lisp
;; github
(setq org-github-issues-org-file (concat org-directory "/github.org"))
#+end_src

#+begin_src emacs-lisp
;; shortcut for note.org
(defun my/show-org-buffer (file)
  "Show an org-file FILE on the current buffer."
  (interactive)
  (if (get-buffer file)
      (let ((buffer (get-buffer file)))
        (switch-to-buffer buffer)
        (message "%s" file))
    (find-file (concat org-directory file))))
(global-set-key (kbd "C-^") '(lambda () (interactive)
                               (my/show-org-buffer "note.org")))

;; Github
(use-package! org-sync
  :after org
  :config
  (defvar org-sync-backend-alist
    '(("github.com/\\(?:repos/\\)?[^/]+/[^/]+"  . org-sync-github-backend))))

;; JIRA
;; Refs. https://github.com/ahungry/org-jira

(use-package! org-jira
  :after org
  :config
  (setq jiralib-url "https://leapmind.atlassian.net")
  (setq org-jira-working-dir (concat org-directory "jira"))
  (defconst org-jira-progress-issue-flow
    '(("To Do" . "In Progress")
      ("In Progress" . "Review")
      ("Review" . "DONE"))))

;; asana
;; USE ASANA_TOKEN in env
;; (use-package! asana)

;; arhive command
(defun my-org-archive-done-tasks ()
  (interactive)
  (org-map-entries 'org-archive-subtree "/DONE" 'file))
#+end_src

**** Org-roam: this is not used
not handled by doom
#+begin_src emacs-lisp :tangle no

(use-package! org-roam
  :after org
  :hook
  (org-mode . org-roam-mode)
  :init
  (setq org-roam-directory org-directory)
  :bind
  ("C-c n l" . org-roam)
  ("C-c n t" . org-roam-today)
  ("C-c n f" . org-roam-find-file)
  ("C-c n i" . org-roam-insert)
  ("C-c n g" . org-roam-show-graph))

(after! org-roam (use-package! company-org-roam
 :config
 (push 'company-org-roam company-backends)))
#+end_src

** Org-super-agenda
#+begin_src emacs-lisp
(use-package! org-super-agenda
  :after org-agenda
  :commands (org-super-agenda-mode))
#+end_src
** Deft
#+begin_src emacs-lisp
(use-package! deft
  :after org
  :bind
  ("C-c n d" . deft)
  :custom
  (deft-recursive t)
  (deft-use-filter-string-for-filename t)
  (deft-default-extension "org")
  (deft-directory org-directory))
#+end_src
* Development
** General
General settings for prog-mode

Disable format-all-mode(tmp)
#+begin_src emacs-lisp
(format-all-mode -1)
#+end_src

** lsp-mode
lsp-mode settings
#+begin_src emacs-lisp
(after! lsp-mode
  :config
  (setq lsp-enable-snippet t
        lsp-auto-guess-root t
        lsp-enable-semantic-highlighting t
        lsp-inhibit-message t
        lsp-message-project-root-warning t
        lsp-enable-file-watchers nil
        create-lockfiles nil)
  (setq lsp-keymap-prefix "C-c l"
        ;;lsp-prefer-capf t
        lsp-headerline-breadcrumb-mode t)
  ;; :hook
  ;; (prog-major-mode . lsp-prog-major-mode-enable)
  )
#+end_src

lsp-ui settings
#+begin_src emacs-lisp
(use-package! lsp-ui
  :after lsp-mode
  :config
  (setq scroll-margin 0
        lsp-ui-doc-enable t
        lsp-ui-doc-header t
        lsp-ui-peek-enable t)
  :hook
  (lsp-mode . lsp-ui-mode))
#+end_src

** flycheck
#+begin_src emacs-lisp :tangle no
(use-package! flycheck
  :custom
  (setq flycheck-check-syntax-automatically '(mode-enabled save)
        flycheck-display-errors-delay 0.2
        flycheck-display-errors-function nil
        flycheck-idle-change-delay 1.0)
  :config
  (global-flycheck-mode t) )

(use-package! flycheck-popup-tip
  :after flycheck
  :hook
  (flycheck-mode . flycheck-popup-tip-mode))
#+end_src
** Bazel
Bazel related configs.
#+begin_src emacs-lisp
(use-package! bazel
  :hook (before-save-hook . bazel-mode-buildifier)
  :config
  (setq bazel-buildifier-before-save t)
  (defun find-parent-directory-with-file(name)
    (projectile-locate-dominating-file (file-truename (buffer-file-name)) name)))
#+end_src
** golang
Install gopls
#+begin_src shell :tangle no
GO111MODULE=on go get golang.org/x/tools/gopls@latest
#+end_src

Install required packages
#+BEGIN_SRC sh :tangle no
go get -u github.com/motemen/gore/cmd/gore
go get -u github.com/stamblerre/gocode
go get -u golang.org/x/tools/cmd/godoc
go get -u golang.org/x/tools/cmd/goimports
go get -u golang.org/x/tools/cmd/gorename
go get -u golang.org/x/tools/cmd/guru
go get -u github.com/cweill/gotests/...
go get -u github.com/fatih/gomodifytags
#+END_SRC

go-mode settings
#+begin_src emacs-lisp
(after! go-mode
  (set-company-backend! 'go-mode 'company-go 'company-yasnippet)
  :config
  (setq tab-width 2))
;;(setq completion-ignore-case t)
;;:bind
;;("M-." . godef-jump)
;;("C-M-i" . company-complete)
;;:hook
;;(before-save-hook . gofmt-before-save))
;; (after! company-go
;;   :config
;;   (add-to-list 'company-backends 'company-go))
;; (after! go-eldoc
;;   :hook
;;   (go-mode-hook . go-eldoc-setup))
#+end_src

#+RESULTS:
** Python
Install pyright
#+begin_src shell :tangle no
npm install -g pyright
#+end_src

required packages
#+begin_src shell :tangle no :results none
pip install isort black pyflakes pytest nose
pip install "python-language-server[all]"
#+end_src

** Yaml
Set lsp tab-width
#+begin_src emacs-lisp :tangle no
; (after! yaml-mode;
;   :config
;;   (setq yaml-indent-offset 2))
#+end_src
** Shell
#+begin_src emacs-lisp
(after! sh-script
  (set-company-backend! 'sh-mode '(company-shell :with company-yasnippet))
  (add-hook 'sh-mode #'lsp!))
#+end_src
** terraform
#+begin_src emacs-lisp
(after! terraform-mode
  (setq lsp-terraform-enable-logging t)
  (add-hook 'terraform-mode-hook #'lsp!))
#+end_src

* Operation
** Kubernetes
#+begin_src emacs-lisp
(after! k8s-mode
  :hook
  (k8s-mode . yas-minor-mode)
  :config
  (setq k8s-indent-offset nil
        k8s-site-docs-version "v1.18"))

(use-package! kubernetes
  :commands (kubernetes-overview))
#+end_src
