doom.d/config.el

(global-unset-key "\C-h")
(global-set-key "\C-h" 'delete-backward-char)
(global-set-key "\M-?" 'help-for-help)
(global-set-key "\C-r" 'anzu-query-reqlace)
(global-set-key "\C-s" 'swiper-from-isearch)
(global-set-key "\C-c;" 'comment-region)
(global-set-key "\C-c:" 'uncomment-region)
  ;; (global-set-key "\C-cs" 'query-replace)
(global-set-key "\C-cu" 'scroll-down)

(map!
 ;;"<C-return>" #'other-window
 "C-c C-i" #'indent-region
 "C-c ;" #'comment-region
 "C-c :" #'uncomment-region
 "C-s" #'swiper-from-isearch
 "C-r" #'anzu-query-replace
 "C-c s" #'query-replace
 "C-c u" #'scroll-down
 ;;"M-/"  #'undo-tree-redo

 ;; ivy
 "C-x b" #'ivy-switch-buffer
 "C-c g" #'counsel-rg

 ;; avy
 "C-:" #'avy-goto-char
 "C-'" #'avy-goto-char-2

 ;; org-mode
 ;;"C-c l"  #'org-store-link
 "C-c a"  #'org-agenda

 ;; visual-regexp
 ;; "C-c r" #'vr/replace
 ;; "C-c q" #'vr/query-replace
 ;; "C-c m" #'vr/mc-mark

 ;; org-roam
 ;; "C-c n l" #'org-roam
 ;; "C-c n t" #'org-roam-today
 ;; "C-c n f" #'org-roam-find-file
 ;; "C-c n i" #'org-roam-insert
 ;; "C-c n g" #'org-roam-show-graph
 )

;; Custom variables
(setq custom-file (expand-file-name "custom.el" user-emacs-directory))
(when (file-exists-p custom-file)
  (load custom-file))

;; the use-package!, after!, add-hook! and setq-hook! macros are your bread and butter.
;;
;; Here are some additional functions/macros that could help you configure Doom:
;;
;; - `load!' for loading external *.el files relative to this one
;; - `use-package' for configuring packages
;; - `after!' for running code after a package has loaded
;; - `add-load-path!' for adding directories to the `load-path', relative to
;;   this file. Emacs searches the `load-path' when you load packages with
;;   `require' or `use-package'.
;; - `map!' for binding new keys
;;
;; To get information about any of these functions/macros, move the cursor over
;; the highlighted symbol at press 'K' (non-evil users must press 'C-c g k').
;; This will open documentation for it, including demos of how they are used.
;;
;; You can also try 'gd' (or 'C-c g d') to jump to their definition and see how they are implemented.

(provide 'config)
;;; config.el ends here
